back-end/agriPost/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        posts = Post.find(params[:id])

INSERT INTO "posts" ("post_name", "post_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_name", "hola"], ["post_description", "Hola2\n"], ["created_at", "2024-04-29 04:57:01.073360"], ["updated_at", "2024-04-29 04:57:01.073360"]]
---
    def create
        posts = Post.create(posts_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "post_description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["post_description", "HamsterEdit"], ["updated_at", "2024-04-29 06:22:11.748627"], ["id", 1]]
---
    def update
        posts = Post.find_by(id: params[:id])
        posts.update(posts_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 7]]
SELECT "posts".* FROM "posts"
---
    def destroy
        posts = Post.find_by(id: params[:id])
        posts.destroy
        posts = Post.all